package com.ohgiraffers.section03.abstraction;

public class Application {
    public static void main(String[] args) {
        /* 수업목표. 객체지향 프로그래밍에 대한 이해 및 객체와 클래스 설계 후 프로그래밍 */
        /* 필기.
         *  추상화 -> 공통된 부분을 추출하고 공통되지 않고 불필요한 부분 제거 (유연석 확보)
         *  유연성 확보 -> 여러 곳에 적응될 수 있는 유연한 객체, 재사용성이 높아짐
        * */

        /* 필기.
         *  프로그램 개요 -> 카레이서가 자동차 운전하는 프로그램
         *  시스템 요구사항
         *  1. 카레이서는 시동걸기, 엑셀레이터 밟기, 브레이크 밟기, 시동 끄기 가능
         *  2. 자동차는 시동 걸기, 앞으로 가기, 멈추기, 시동 끄기 가능
         *  3.
        * */
    }
}
